/* 计科 2350222 盛曦 */
#include <iostream>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void f_sub(int x)
{
	cout << "x = " << x << endl;
}

/***************************************************************************
  函数名称：print_prompt
  功    能：输出指定字符串prompt
  输入参数：const char* prompt
  返 回 值：void (*p)(int),即指向返回类型为void，形参为int的函数的指针
  说    明：
***************************************************************************/
void (*print_prompt(const char* prompt))(int)
{
	cout << "str = " << prompt << endl;
	void (*p)(int x);
	p = f_sub;
	return p;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	void(*(*f[3])(const char* p))(int x);

	f[0] = print_prompt;

	f[0]("Hello")(2);
	f[0]("Tongji")(7);

	return 0;
}